<h1>&#1063;&#1090;&#1086; &#1090;&#1072;&#1082;&#1086;&#1077; DCC::QuickSite?</h1>

<h2>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;</h2>

DCC::QuickSite - &#1101;&#1090;&#1086; &#1073;&#1101;&#1082;-&#1101;&#1085;&#1076; &#1076;&#1074;&#1080;&#1078;&#1082;&#1072; &#1089;&#1072;&#1081;&#1090;&#1072;, &#1087;&#1088;&#1080;&#1075;&#1086;&#1076;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103;
&#1089;&#1072;&#1081;&#1090;&#1086;&#1074; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1083;&#1102;&#1073;&#1086;&#1081; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074;.
&#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086; &#1073;&#1083;&#1072;&#1075;&#1086;&#1076;&#1072;&#1088;&#1103; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1091; &#1082;&#1077;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; &#1085;&#1072; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1077;
&#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1089;&#1085;&#1080;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1085;&#1072; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;. &#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082; &#1078;&#1077;
&#1089;&#1078;&#1072;&#1090;&#1080;&#1077; gZip &#1080; &#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1083;&#1086;&#1075;&#1086;&#1074; &#1087;&#1086;&#1089;&#1077;&#1097;&#1077;&#1085;&#1080;&#1081;.

<a href="#toc_21">&#1064;&#1072;&#1073;&#1083;&#1086;&#1085; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099;</a> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1102;&#1102; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091;
&#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1083;&#1102;&#1073;&#1086;&#1081; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1055;&#1088;&#1080;&#1095;&#1105;&#1084; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086;
&#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072;, &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1080;&#1083;&#1080; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;,
&#1095;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1074; &#1086;&#1073;&#1097;&#1091;&#1102; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091; &#1082;&#1072;&#1082; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1090;&#1072;&#1082; &#1080; &#1076;&#1080;&#1085;&#1072;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090;
&#1073;&#1077;&#1079; &#1082;&#1072;&#1082;&#1080;&#1093;-&#1083;&#1080;&#1073;&#1086; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089; &#1088;&#1072;&#1079;&#1085;&#1086;&#1088;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090;&#1086;&#1084;.

&#1042; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; DCC &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085; &#1090;&#1072;&#1082; &#1078;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; &#1057;&#1059;&#1041;&#1044; MySQL.

<h2>&#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103;</h2>

&#1044;&#1072;&#1085;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1077;&#1081; <a href="/doc/license.htm">LGPL</a>.

<h1>&#1048;&#1085;&#1089;&#1090;&#1072;&#1083;&#1083;&#1103;&#1094;&#1080;&#1103; &#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;</h1>

&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074; &#1087;&#1088;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1080; DCC::QuickSite &#1085;&#1072; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1077;:
<pre>
/					- &#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1081; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;
.htaccess				- &#1092;&#1072;&#1081;&#1083; .htaccess
/dcc/
    /index.php				- &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;
    /cache/				- &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1082;&#1077;&#1096;&#1072;
    /data/				- &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;
    /img/				- &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1086;&#1082;
    /lib/				- &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;
        /class.index.inc		- &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090;&#1072; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;
        /class.doc.inc		- &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088; &#1076;o&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088;&#1099;
        /dcc/
            /class.dcc.inc		- DCC::QuickSite Pro
            /class.engine.inc	- &#1082;&#1083;&#1072;&#1089;&#1089; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;
            /class.mysql.inc		- &#1082;&#1083;&#1072;&#1089;&#1089; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080; MySQL
            /class.parser.inc	- &#1087;&#1072;&#1088;&#1089;&#1077;&#1088; &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; URI
            /class.root.inc		- &#1082;&#1083;&#1072;&#1089;&#1089; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;
    /logs/				- &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1083;&#1086;&#1075;&#1086;&#1074;
    /templates/			- &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074;
</pre>
<h2>&#1050;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1099;</h2> - &#1092;&#1072;&#1081;&#1083; /dcc/index.php

<h3>PATH</h3> - &#1040;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100; &#1082; &#1082;&#1086;&#1088;&#1085;&#1102; &#1089;&#1072;&#1081;&#1090;&#1072;. &#1042;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;.<br />
<h3>CACHE</h3> - &#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1082;&#1077;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;. Default=TRUE<br />
<h3>LOGGING</h3> - &#1042;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1083;&#1086;&#1075;&#1086;&#1074;. Default=FALSE<br />
<h3>FLOCKING</h3> - &#1060;&#1072;&#1081;&#1083;&#1086;&#1074;&#1099;&#1081; &#1089;&#1077;&#1084;&#1072;&#1092;&#1086;&#1088;. Default=TRUE<br />
<h3>CLEAR</h3> - &#1054;&#1095;&#1080;&#1089;&#1090;&#1082;&#1072; &#1074;&#1099;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; HTML &#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1079;&#1080;&#1090;&#1085;&#1099;&#1093; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;. Default=TRUE<br />
<h3>GZIP</h3> - &#1050;&#1086;&#1084;&#1087;&#1088;&#1077;&#1089;&#1089;&#1080;&#1103; gZip. Default=FALSE<br />
<h3>MYSQL</h3> - &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; MySQL. Default=FALSE<br />


<h2>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;</h2> - &#1092;&#1072;&#1081;&#1083; /dcc/lib/dcc/class.root.inc

<h3>expireTime</h3>
- &#1042;&#1088;&#1077;&#1084;&#1103; "&#1078;&#1080;&#1079;&#1085;&#1080;" &#1082;&#1077;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;. Default: 86400 &#1089;&#1077;&#1082;. (1 &#1089;&#1091;&#1090;&#1082;&#1080;)

<h3>depth</h3>
- &#1043;&#1083;&#1091;&#1073;&#1080;&#1085;&#1072; &#1088;&#1077;&#1082;&#1091;&#1088;&#1089;&#1080;&#1080; &#1087;&#1088;&#1077;&#1089;&#1077;&#1090;&#1086;&#1074;. &#1055;&#1088;&#1080; depth=1 &#1087;&#1088;&#1077;&#1089;&#1077;&#1090;&#1099; &#1086;&#1090;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1093;
&#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1075;&#1086; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072;. Default: 1. &#1047;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; depth &#1084;&#1086;&#1078;&#1077;&#1090;
&#1085;&#1077;&#1075;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;.

<h3>SITE</h3>
- &#1048;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1089;&#1072;&#1081;&#1090;&#1072;. &#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1080;&#1084;&#1103; &#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1075;&#1086; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072;. Default: "site".
&#1048;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1085;&#1086;&#1074;&#1091;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085;&#1072;,
&#1080;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1090;&#1100; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085;&#1072; &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1082;&#1072;&#1082;&#1080;&#1093;-&#1083;&#1080;&#1073;&#1086; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1081;.

<h3>DBName, DBHost, DBPass, DBUser</h3>
- &#1055;&#1072;&#1088;&#1072;&#1080;&#1077;&#1090;&#1088;&#1099; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; MySQL.

<h2>&#1064;&#1072;&#1073;&#1083;&#1086;&#1085; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099;</h2> ( structure pattern )

&#1061;&#1088;&#1072;&#1085;&#1080;&#1090;&#1089;&#1103; &#1074; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; _ROOT_ &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; /lib/dcc/class.root.inc. &#1054;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;
&#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1102;&#1102; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091; &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; URI &#1089;&#1072;&#1081;&#1090;&#1072;.

<i>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 1:</i>
<pre>
$_ROOT_ = array (
	""	=> "index",
	"test"	=> array (
		""	=> "test_index",
		"*"	=> "test_page",
		),
	);
</pre>
&#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086; 3 &#1074;&#1080;&#1076;&#1072; &#1091;&#1079;&#1083;&#1086;&#1074; (node):

1. &#1055;&#1091;&#1089;&#1090;&#1086;&#1081; &#1091;&#1079;&#1077;&#1083; ("") - &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090; DirectoryIndex.<br />
2. &#1059;&#1079;&#1077;&#1083; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; ("*") - &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1091;&#1079;&#1077;&#1083; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1087;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1080; &#1082; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1084; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1084;
&#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1077;&#1089;&#1083;&#1080; &#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1091;&#1079;&#1083;&#1099;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1079;&#1072;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1077;&#1084;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;.<br />
3. &#1055;&#1088;&#1077;&#1076;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1081; &#1091;&#1079;&#1077;&#1083; ("[value]") - &#1101;&#1090;&#1086;&#1090; &#1091;&#1079;&#1077;&#1083; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1080;
&#1082; &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084;&#1091; URI, &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1077;&#1084;&#1091; &#1089; value.

&#1044;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1091;&#1102; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091;:
<pre>
	/				- &#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1081; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; (index)
	/test/				- &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; test
	/test/page_name[.htm[l]]	- &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; test &#1089; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;
</pre>
&#1042; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1076;&#1083;&#1103; &#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072; &#1089;&#1072;&#1081;&#1090;&#1072; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; (&#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088;) index,
&#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072; test - &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; test_index &#1080;&#1083;&#1080; (&#1087;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1080; &#1082; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;&#1081;
&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072; test) - test_page.

&#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; 404 &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; test
&#1074;&#1086;&#1079;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088; test_page. &#1042; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; 404 &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072;
&#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;, &#1085;&#1072; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1088;&#1072;&#1079;&#1073;&#1086;&#1088;&#1072; &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; URI. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1088;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103;
&#1082; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; /qwert/ &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; 404. &#1042; &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1082;&#1072;&#1082; &#1076;&#1083;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; /test/qwert.htm
&#1086;&#1096;&#1080;&#1073;&#1082;&#1072; 404 &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088;&#1086;&#1084; test_page, &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;,
&#1090;&#1086; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1072;&#1083;&#1080;&#1076;&#1085;&#1086;&#1081;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1078;&#1077; &#1076;&#1083;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; /test/qwert/page_1.htm &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;
404 &#1074;&#1085;&#1086;&#1074;&#1100; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072; &#1085;&#1072; &#1089;&#1090;&#1072;&#1076;&#1080;&#1080; &#1088;&#1072;&#1079;&#1073;&#1086;&#1088;&#1072; &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; URI, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1091;&#1079;&#1077;&#1083; "*"
&#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; test &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085; &#1082;&#1072;&#1082; &#1089;&#1082;&#1072;&#1083;&#1103;&#1088;, &#1072; &#1085;&#1077; &#1082;&#1072;&#1082; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074; (&#1077;&#1089;&#1083;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086;
&#1076;&#1083;&#1103; &#1091;&#1079;&#1083;&#1072; "qwert" &#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088;). &#1042; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099;
&#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1080;&#1084;&#1077;&#1090;&#1100; &#1090;&#1072;&#1082;&#1086;&#1081; &#1074;&#1080;&#1076;:

<i>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 2:</i>
<pre>
$_ROOT_ = array (
	""	=> "index",
	"test"	=> array (
		""	=> "test_index",
		"*"	=> array (
			""	=> "test_page",
			"*"	=> "test_page",
			),
		),
	);
</pre>
&#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1074;&#1089;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; URI, &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1079;&#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; /test/ &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085;&#1099;
&#1074;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1102;&#1102; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; $ARGS &#1074; &#1074;&#1080;&#1076;&#1077; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1072;. &#1042;&#1087;&#1086;&#1083;&#1085;&#1077; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;
&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080; &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088;&#1072; &#1076;&#1083;&#1103; &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1091;&#1079;&#1083;&#1086;&#1074;.

&#1057;&#1089;&#1099;&#1083;&#1082;&#1080; &#1074;&#1080;&#1076;&#1072; /page, /page.htm &#1080; /page.html &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1099;. &#1057;&#1089;&#1099;&#1083;&#1082;&#1072; &#1074;&#1080;&#1076;&#1072; /page/ (&#1072; &#1090;&#1072;&#1082; &#1078;&#1077; <nobr>/page/other_page[.htm[l]]</nobr>) &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;,
&#1095;&#1090;&#1086; &#1091;&#1079;&#1077;&#1083; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099; (SPaN - Structure Pattern Node) "page" &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1082;&#1072;&#1083;&#1103;&#1088;&#1086;&#1084; &#1080; &#1076;&#1083;&#1103; &#1085;&#1077;&#1075;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1082;&#1072;&#1082; &#1084;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084; &#1091;&#1079;&#1083;&#1099;
"" &#1080; "*" (&#1080;&#1083;&#1080; "other_page") &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;. &#1042; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; 404.

<h1>Front-end</h1>

<h2>&#1052;&#1086;&#1076;&#1091;&#1083;&#1100; D&#1057;&#1057;::dcc</h2>

&#1042;&#1089;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084;&#1080; POST &#1080; GET, &#1072; &#1090;&#1072;&#1082; &#1078;&#1077; COOKIE, SESSION &#1080; FILES,
&#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1072; &#1085;&#1077; &#1074; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;.

<h3>assign</h3> - &#1048;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; (&#1087;&#1083;&#1077;&#1081;&#1089;&#1093;&#1086;&#1076;&#1077;&#1088;&#1072;)
<pre>
assign (string [.]template_name [, string value ]);
</pre>
&#1045;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076; template_name &#1089;&#1090;&#1086;&#1080;&#1090; &#1090;&#1086;&#1095;&#1082;&#1072;, &#1090;&#1086; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086;
&#1082; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1084;&#1091;. &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; Value &#1084;&#1086;&#1078;&#1077;&#1090; &#1090;&#1072;&#1082; &#1078;&#1077; &#1073;&#1099;&#1090;&#1100; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072;, &#1090;&#1086;&#1075;&#1076;&#1072; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;
&#1082;&#1088;&#1086;&#1089;&#1089;-&#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; (&#1087;&#1086;&#1076;&#1084;&#1077;&#1085;&#1072;) &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;.

<h3>wrap</h3> - &#1084;&#1072;&#1089;&#1089;&#1086;&#1074;&#1072;&#1103; &#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1087;&#1083;&#1077;&#1081;&#1089;&#1093;&#1086;&#1083;&#1076;&#1077;&#1088;&#1086;&#1074;.
<pre>
wrap (array template_list);
</pre>
template_list - &#1093;&#1101;&#1096; &#1074;&#1080;&#1076;&#1072; 'template_name' => 'value';

<h3>purge</h3> - &#1086;&#1073;&#1085;&#1091;&#1083;&#1077;&#1085;&#1080;&#1077; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; &#1080;&#1083;&#1080; &#1074;&#1089;&#1077;&#1093; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074;
<pre>
purge ([string template_name]);
</pre>
&#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; template_name &#1085;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;, &#1086;&#1073;&#1085;&#1091;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1081; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;.

<h3>summon</h3> - &#1063;&#1090;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; file_name &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1091;&#1102; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102;.
<pre>
&string = summon (string file_name);
</pre>
&#1056;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077;, &#1095;&#1077;&#1084; implode("", file($name));<br />
&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1085;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;.

<h2>&#1052;&#1086;&#1076;&#1091;&#1083;&#1100; D&#1057;&#1057;::db</h2>

<i>Documentation coming soon</i>

<h2>&#1052;&#1086;&#1076;&#1091;&#1083;&#1100; DCC::engine</h2>

&#1052;&#1086;&#1076;&#1091;&#1083;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1074;&#1089;&#1077;&#1084; &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088;&#1072;&#1084;.

<h2>&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; (&#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088;&#1099;)</h2>

<h3>CACHE</h3> - &#1056;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1077;&#1090; &#1082;&#1077;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088;&#1072;.

<h3>TEMPL</h3> - &#1064;&#1072;&#1073;&#1083;&#1086;&#1085;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1088;&#1072;&#1074;&#1077;&#1085; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072; $SITE.

&#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; &#1076;&#1074;&#1091;&#1093; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081; - &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; (obligatory) &#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1086;&#1081;
&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; (user-defined).

<h3>_init</h3> - &#1054;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;

&#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1097;&#1072;&#1077;&#1090; last_modified &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088;&#1072;, &#1080;&#1083;&#1080; FALSE, &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; "&#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;&#1081; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; 404"
&#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088;&#1072;.

<i>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 5 .</i>
<pre>
 function _init() {
	$this->SELF = $this->DataDir."/".($this->ARGS[0] ? $this->ARGS[0] : 'index').".htm";
	return file_exists($this->SELF) ? filemtime($this->SELF) : FALSE;
 }
</pre>
&#1044;&#1072;&#1085;&#1085;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090;, &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1083;&#1080; &#1092;&#1072;&#1081;&#1083; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1084; &#1074; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074;&#1077; $ARGS,
&#1048; &#1077;&#1089;&#1083;&#1080; &#1076;&#1072;, &#1090;&#1086; &#1074;&#1099;&#1076;&#1072;&#1105;&#1090; &#1074;&#1088;&#1077;&#1084;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1085;&#1077;&#1090; - &#1090;&#1086; FALSE.

&#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1085;&#1072;&#1103; &#1074; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; 5 &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080;&#1075;&#1086;&#1076;&#1085;&#1072; &#1076;&#1083;&#1103; &#1074;&#1099;&#1076;&#1072;&#1095;&#1080; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090;&#1072; &#1074; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103;&#1093; &#1074;&#1080;&#1076;&#1072;
/test/page_1.htm

<h3>_execute</h3> - &#1054;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;

&#1054;&#1090;&#1074;&#1077;&#1095;&#1072;&#1077;&#1090; &#1079;&#1072; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088;&#1072;. &#1042;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1088;&#1077;&#1085;&#1076;&#1077;&#1088;&#1080;&#1085;&#1075;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;
&#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088;&#1086;&#1084; DCC &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; main().

<h1>&#1064;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</h1>

<h2>&#1057;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;</h2>

&#1065;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1074; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; /dcc/templates/ &#1080; &#1080;&#1084;&#1077;&#1102;&#1090; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;
.tpl. &#1050;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1081; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1080;&#1084;&#1077;&#1077;&#1090; &#1080;&#1084;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1077;&#1077; &#1089; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084; &#1089;&#1072;&#1081;&#1090;&#1072;
(site.tpl).

<h3>&#1054;&#1073;&#1097;&#1080;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072;</h3>

<i>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 3 - &#1087;&#1088;&#1086;&#1089;&#1090;&#1077;&#1081;&#1096;&#1080;&#1081; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;.</i>
<pre>
<tpl:site>
<html>
	<head>
	<title><tpl:title /></title>
	</head>

	<body>
	<tpl:content />
	</body>
</html>
</tpl:site>
</pre>
&#1044;&#1072;&#1085;&#1085;&#1099;&#1081; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1075;&#1086; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; &#1089;&#1072;&#1081;&#1090;&#1072; &#1089; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084; "site", &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; 2 &#1087;&#1083;&#1077;&#1081;&#1089;&#1093;&#1086;&#1083;&#1076;&#1077;&#1088;&#1072; (placeholders) - <b>title</b> &#1080; <b>content</b>.

<h3>&#1064;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099;</h3>

<i>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 4.1</i>
<pre>
<tpl:site>

	<tpl:menu_item>
	<b>::</b> <a href="<tpl:menu_href />"><tpl:menu_link /></a><br>
	</tpl:menu_item>

</tpl:site>
</pre>
&#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1084;&#1077;&#1085;&#1102; &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1085;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; 4. &#1047;&#1076;&#1077;&#1089;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; menu_item, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081;
&#1086;&#1076;&#1080;&#1085; &#1087;&#1091;&#1085;&#1082;&#1090; &#1084;&#1077;&#1085;&#1102;, &#1072; &#1090;&#1072;&#1082; &#1078;&#1077; 2 &#1087;&#1083;&#1077;&#1081;&#1089;&#1093;&#1086;&#1083;&#1076;&#1077;&#1088;&#1072; menu_href (&#1089;&#1089;&#1099;&#1083;&#1082;&#1072;) &#1080; menu_link (&#1090;&#1077;&#1082;&#1089;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080;).
&#1048;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1087;&#1083;&#1101;&#1081;&#1089;&#1093;&#1086;&#1083;&#1076;&#1077;&#1088;&#1086;&#1074; &#1080; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080; assign &#1080; wrap. &#1042; &#1085;&#1072;&#1096;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;
&#1101;&#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1090;&#1072;&#1082;:

<i>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 4.2</i>
<pre>
$link = array (
	"menu_href" => "http://gregory.pp.ru",
	"menu_link" => "Gregory's home page",
	);

$this->wrap($link);
</pre>
&#1064;&#1072;&#1073;&#1083;&#1086;&#1085; menu_item &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;, &#1087;&#1088;&#1080; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1077; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; site, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1075;&#1086;
&#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084;. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1084; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; 4.2 &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1077;:

<b>::</b> <a href="http://gregory.pp.ru">Gregory's home page</a>

<i>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; 4.3</i>
<pre>
$menu = array (
	"Index"			=> "/",
	"Gregory's home page"	=> "http://gregory.pp.ru",
	"LGPL License"		=> "/doc/license.htm",
	);

foreach ($menu as $name => $link) {
	$this->assign("menu_href", $name);
	$this->assign("menu_link", $link);
	$this->assign(".menu_item");
}
</pre>
&#1042; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; 4.3 &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; menu_item &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1080;&#1090;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1094;&#1080;&#1082;&#1083;&#1072; &#1089; &#1085;&#1086;&#1074;&#1099;&#1084;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;,
&#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; <b>&#1090;&#1086;&#1095;&#1082;&#1072;</b> (.) &#1087;&#1077;&#1088;&#1077;&#1076; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; &#1074; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; assign &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;
&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; &#1085;&#1072; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1085;&#1086;&#1074;&#1086;&#1081; &#1080;&#1090;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085; (append) &#1082; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1084;&#1091; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1102;.
&#1042; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;.
&#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1072; &#1084;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1084; &#1085;&#1072; &#1074;&#1099;&#1093;&#1086;&#1076;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1077;:

<b>::</b> <a href="/">Index</a><br>
<b>::</b> <a href="http://gregory.pp.ru">Gregory's home page</a><br>
<b>::</b> <a href="/doc/license.htm">LGPL License</a><br>

<h2>&#1055;&#1088;&#1077;&#1089;&#1077;&#1090;&#1099;</h2>

<h3>include</h3> - &#1042;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072;.
<pre>
<tpl:include file="other_template.tpl" />
<tpl:include file="other_template.tpl" used_by="wr&#1072;pper_name" />
<tpl:include self />
</pre>
&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; file &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1055;&#1088;&#1080; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; used_by &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090;
&#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1080;&#1079; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;
&#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;, &#1090;&#1086; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072;. &#1058;&#1072;&#1082;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090;
&#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1090;&#1100; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074;.

&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; self &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;, &#1080;&#1084;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;
&#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088;&#1072;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1099;&#1084; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1080;
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; file &#1080; used_by, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074; &#1076;&#1083;&#1103;
&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1072;&#1087;&#1087;&#1077;&#1088;&#1072;. &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; self &#1086;&#1073;&#1089;&#1083;&#1091;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1095;&#1072;&#1089;&#1090;&#1086; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1102;&#1097;&#1091;&#1102;&#1089;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1102;,
&#1082;&#1086;&#1075;&#1076;&#1072; &#1074; &#1077;&#1076;&#1080;&#1085;&#1086;&#1084; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1075;&#1086; &#1089;&#1072;&#1081;&#1090;&#1072; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;, &#1089;&#1082;&#1072;&#1078;&#1077;&#1084;, &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1086;&#1085;&#1090;&#1077;&#1085;&#1090;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100;
(&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1076;&#1083;&#1103; &#1075;&#1086;&#1089;&#1090;&#1077;&#1074;&#1086;&#1081; &#1082;&#1085;&#1080;&#1075;&#1080;, &#1092;&#1086;&#1088;&#1091;&#1084;&#1072;, &#1075;&#1072;&#1083;&#1077;&#1088;&#1077;&#1080; &#1080; &#1087;&#1088;&#1086;&#1095;.), &#1072; &#1074;&#1089;&#1105; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1086;&#1092;&#1086;&#1088;&#1084;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1089;&#1090;&#1072;&#1105;&#1090;&#1089;&#1103;
&#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084;.

<h3>last_modified</h3> - &#1042;&#1088;&#1077;&#1084;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1074; ISO-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077;.

<h3>timestamp</h3> - &#1058;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1080; &#1076;&#1072;&#1090;&#1072;.